Repository: OmarShishani-Sedco/Bank-Configuration-Portal
Catalog: Bank-Configuration-Portal/Resources/Language.*.resx
Languages: ar

# Application_Label
source: Bank Configuration Portal
ar: بوابة إعدادات البنك

# Branches_Title
source: Branches
ar: الفروع

# Branch_IsActive
source: Active
ar: مفعل

# NameArabic_Required
source: Name (Arabic) is required
ar: الاسم (عربي) مطلوب

# NameEnglish_Required
source: Name (English) is required
ar: الاسم (إنجليزي) مطلوب

# Home_Title
source: Home
ar: الرئيسية

# Login_BankName_Label
source: Bank Name
ar: اسم البنك

# Login_BankName_Placeholder
source: Enter bank name
ar: أدخل اسم البنك

# Login_BankName_Required
source: Bank Name is required
ar: اسم البنك مطلوب

# Login_Button
source: Log In
ar: تسجيل الدخول

# Login_Error_NoBank
source: Bank not found.
ar: لم يتم العثور على البنك.

# Generic_Error
source: An error occurred. Please try again
ar: حدث خطأ ما. يرجى المحاولة مرة أخرى

# Login_Invalid_Bank
source: Invalid bank name.
ar: اسم البنك غير صحيح

# Login_Title
source: Login
ar: تسجيل الدخول

# Login_Unauthorized_User
source: User is not authorized for this bank
ar: المستخدم غير موجود أو غير مصرح له الوصول لهذا البنك

# Login_UserName_Label
source: Username
ar: اسم المستخدم

# Login_UserName_Placeholder
source: Enter username
ar: أدخل اسم المستخدم

# UserName_Required
source: Username is required
ar: اسم المستخدم مطلوب

# Logout_Button
source: Log Out
ar: تسجيل الخروج

source: Branch created successfully.
ar: تم إنشاء الفرع بنجاح

# Branch_Name_Placeholder
source: Enter branch name
ar: أدخل اسم الفرع

source: Branch updated successfully.
ar: تم تحديث الفرع بنجاح

source: Branch deleted successfully.
ar: تم حذف الفرع بنجاح

source: Branch not found.
ar: الفرع غير موجود.

# Branch_Create_Title
source: Create Branch
ar: إضافة فرع

# Branch_Edit_Title
source: Edit Branch
ar: تعديل الفرع

# Branch_Create_Button
source: Create New Branch
ar: إنشاء فرع جديد

# Update_Button
source: Update
ar: تحديث

# Branch_Index_Title
source: Branches
ar: الفروع

# NameEnglish_Label
source: Name (English)
ar: الاسم (إنجليزي)

# NameArabic_Label
source: Name (Arabic)
ar: الاسم (عربي)

# IsActive_Label
source: Status
ar: الحالة

# Edit_Label
source: Edit
ar: تعديل

# Delete_Label
source: Delete
ar: حذف

# ConfirmDelete_Message
source: Are you sure you want to delete this record?
ar: هل أنت متأكد من رغبتك بحذف هذا السجل؟

source: No records found.
ar: لا توجد سجلات

# Active_Label
source: Active
ar: نشط

# Inactive_Label
source: Inactive
ar: غير نشط

# Actions_Label
source: Actions
ar: الإجراءات

# Branch_NameEnglish_Placeholder
source: Enter branch name (EN)
ar: أدخل اسم الفرع (انجليزي)

# Branch_NameArabic_Placeholder
source: Enter branch name (AR)
ar: أدخل اسم الفرع (عربي)

source: Is Active
ar: نشط

# NameEnglish_Invalid
source: Only English characters allowed
ar: أدخل الاسم بالانجليزي

# NameArabic_Invalid
source: Only Arabic characters allowed
ar: أدخل الاسم بالعربي

# NameEnglish_MaxLimit
source: The field Name (English) has a max limit of a (100) characters
ar: حقل اسم الفرع (انجليزي) له حد اقصى (100) حرف

# NameArabic_MaxLimit
source: The field Name (Arabic) has a max limit of a (100) characters
ar: حقل اسم الفرع (عربي) له حد اقصى (100) حرف

source: Logout
ar: تسجيل الخروج

# Logout_Confirm_Message
source: Are you sure you want to log out?
ar: هل تريد تسجيل الخروج

# Logout_Confirm_Title
source: Confirm Logout
ar: تأكيد تسجيل الخروج

# Cancel_Button
source: Cancel
ar: الغاء

source: Force Save
ar: تأكيد التعديل

source: Reload changes
ar: تحديث التغييرات

# Branch_Concurrency_Error
source: The branch has been modified by another user
ar: تم تحديث بيانات الفرع بواسطة مستخدم آخر

# Branch_Delete_Concurrency_Error
source: The branch has been modified by another user. Are you sure you want to delete it?
ar: تم تحديث بيانات الفرع بواسطة مستخدم آخر. هل انت متأكد من حذفه؟

# Branch_Already_Deleted
source: Branch already deleted by another user (Refreshing changes)
ar: تم حذف الفرع بواسطة مستخدم اخر (تم تحديث التغييرات)

# Concurrency_ForcePrompt
source: Are you sure you want to enforce your changes
ar: هل انت متأكد من تعديل البيانات

# Concurrency_ForceFailed
source: Concurrent update failed
ar: فشل التحديث المتزامن

# Branch_NoChangesDetected
source: No changes detected to branch
ar: لا يوجد تحديثات على الفرع

# Bank_Arab Bank
source: Arab Bank
ar: البنك العربي

source: Go
ar: عرض

source: Page
ar: صفحة

source: Service Created Successfully
ar: تم إنشاء الخدمة بنجاح

source: Service Updated Successfully
ar: تم تحديث الخدمة بنجاح

source: Service Deleted Successfully
ar: تم حذف الخدمة بنجاح

# Service_Concurrency_Error
source: The service has been modified by another user
ar: تم تحديث بيانات الخدمة بواسطة مستخدم آخر

# Service_Delete_Concurrency_Error
source: The service has been modified by another user. Are you sure you want to delete it?
ar: تم تحديث بيانات الخدمة بواسطة مستخدم آخر. هل انت متأكد من حذفه؟

# Service_Already_Deleted
source: Service already deleted by another user (Refreshing changes)
ar: تم حذف الخدمة بواسطة مستخدم اخر (تم تحديث التغييرات)

source: Service not found.
ar: الخدمة غير موجودة.

# Service_Tickets_Range
source: Tickets range should be between (1-100)
ar: يجب ان يتراوح عدد التذاكر بين (1-100)

# Service_Create_Button
source: Create New Service
ar: إنشاء خدمة جديدة

# Service_Index_Title
source: Services
ar: الخدمات

# MaxTickets_Label
source: Max Tickets per day
ar: الحد الأقصى للتذاكر في اليوم الواحد

# Service_Create_Title
source: Create Service
ar: إنشاء الخدمة

# Service_Edit_Title
source: Edit Service
ar: تعديل الخدمة

# Service_NameEnglish_Placeholder
source: Enter service name (EN)
ar: أدخل اسم الخدمة (انجليزي)

# Service_NameArabic_Placeholder
source: Enter service name (AR)
ar: أدخل اسم الخدمة (عربي)

# Service_NoChangesDetected
source: No changes detected to service
ar: لا يوجد تحديثات على الخدمة

source: Counter Created Successfully
ar: تم إنشاء الشباك بنجاح

source: Counter Updated Successfully
ar: تم تحديث الشباك بنجاح

source: Counter Deleted Successfully
ar: تم حذف الشباك بنجاح

# Counter_Concurrency_Error
source: The Counter has been modified by another user
ar: تم تحديث بيانات الشباك بواسطة مستخدم آخر

# Counter_Delete_Concurrency_Error
source: The Counter has been modified by another user, Are you sure you want to delete it?
ar: تم تحديث بيانات الشباك بواسطة مستخدم آخر. هل انت متأكد من حذفه؟

# Counter_Already_Deleted
source: Counter already deleted by another user (Refreshing changes)
ar: تم حذف الشباك بواسطة مستخدم اخر (تم تحديث التغييرات)

source: Counter not found.
ar: الشباك غير موجود.

# Counter_Create_Button
source: Create New Counter
ar: إنشاء شباك جديد

# Counter_Index_Title
source: Counters
ar: الشبابيك

# Counter_Create_Title
source: Create Counter
ar: إنشاء الشباك

# Counter_Edit_Title
source: Edit Counter
ar: تعديل الشباك

# Counter_NameEnglish_Placeholder
source: Enter Counter name (EN)
ar: أدخل اسم الشباك (انجليزي)

# Counter_NameArabic_Placeholder
source: Enter Counter name (AR)
ar: أدخل اسم الشباك (عربي)

# Counter_NoChangesDetected
source: No changes detected to Counter
ar: لا يوجد تحديثات على الشباك

# Counter_Type_Label
source: Counter Type
ar: نوع الشباك

# View_Counters_Button
source: View Counters
ar: عرض الشبابيك

# Back_To_Branches_Button
source: Back to branches
ar: العودة الى الأفرع

# Select_Type_Placeholder
source: Select Type
ar: اختر نوع الشباك

# CounterType_Teller
source: Teller
ar: صراف

# CounterType_CustomerService
source: Customer Service
ar: خدمة الزبائن

source: No services allocated
ar: لا توجد خدمات مخصصة

# Active_Service_Index_Title
source: Active Services
ar: الخدمات النشطة

# Selected_Service_Index_Title
source: Selected Services
ar: الخدمات المختارة

# More_Button
source: More
ar: المزيد

# Select_Button
source: --Select--
ar: --اختر--

# Search_Name_Placeholder
source: Enter Name (AR/EN)
ar: ادخل الاسم (انجليزي/عربي)

# Clear_Button
source: Clear
ar: مسح

# Search_Button
source: Search
ar: بحث

# Search_Name_Label
source: Name
ar: الاسم

# Refresh_Button
source: Refresh Changes
ar: تحديث التغييرات

# Concurrency_Conflict_Title
source: Concurrency Conflict
ar: تعارض في تزامن البيانات

# Login_Password_Placeholder
source: Enter your password
ar: أدخل كلمة المرور

# ChangePassword_Title
source: Change Password
ar: تغيير كلمة المرور

# ChangePassword_Old_Placeholder
source: Enter your current password
ar: أدخل كلمة المرور الحالية

# ChangePassword_New_Placeholder
source: Enter a new password
ar: أدخل كلمة مرور جديدة

# ChangePassword_Confirm_Placeholder
source: Re-enter the new password
ar: أعد إدخال كلمة المرور الجديدة

# ChangePassword_Button
source: Update Password
ar: تحديث كلمة المرور

# Maint_CreateReset_Title
source: Create / Reset Bank User
ar: إنشاء / إعادة تعيين مستخدم البنك

# Maint_UserName_Label
source: User Name
ar: اسم المستخدم

# Maint_BankId_Label
source: Bank ID
ar: معرّف البنك (ID)

# Maint_CreateReset_Button
source: Create / Reset User
ar: إنشاء / إعادة تعيين المستخدم

# Maint_Result_Created
source: User created successfully.
ar: تم إنشاء المستخدم بنجاح.

# Maint_Result_Reset
source: Password reset successfully.
ar: تم إعادة تعيين كلمة المرور بنجاح.

# Maint_Result_User
source: Username
ar: اسم المستخدم

# Maint_Result_Bank
source: Bank ID
ar: معرّف البنك(ID)

# Maint_Result_Password
source: One-time password
ar: كلمة مرور لمرة واحدة

# Maint_Result_Note
source: User will be forced to change the password on first login.
ar: سيُطلب من المستخدم تغيير كلمة المرور عند أول تسجيل دخول.

# ChangePassword_Success
source: Password changed successfully.
ar: تم تغيير كلمة المرور بنجاح.

# ChangePassword_InvalidOldPassword
source: The current password you entered is incorrect.
ar: كلمة المرور الحالية التي أدخلتها غير صحيحة.

# Login_Invalid_Credentials
source: Invalid password.
ar: كلمة المرور غير صحيحة.

# Login_Password_Label
source: Password
ar: كلمة المرور

# Login_Password_Required
source: Password is required.
ar: كلمة المرور مطلوبة.

# ChangePassword_Old_Label
source: Current Password
ar: كلمة المرور الحالية

# ChangePassword_Old_Required
source: Current password is required.
ar: كلمة المرور الحالية مطلوبة.

# ChangePassword_New_Label
source: New Password
ar: كلمة المرور الجديدة

# ChangePassword_New_Required
source: New password is required.
ar: كلمة المرور الجديدة مطلوبة.

# ChangePassword_Confirm_Label
source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# ChangePassword_Confirm_Required
source: Please confirm the new password.
ar: يجب تأكيد كلمة المرور الجديدة.

# MaxLength_100
source: Maximum length is 100 characters.
ar: الحد الأقصى 100 حرف.

# Password_Min_Length
source: Password must be at least 8 characters.
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل.

# Passwords_Must_Match
source: The password and confirmation do not match.
ar: كلمتا المرور غير متطابقتين.

# ChangePassword_Required_Note
source: Please change your password to continue.
ar: يرجى تغيير كلمة المرور للمتابعة.

# Maint_BankId_Required
source: Bank ID is required
ar: معرف البنك (ID) مطلوب

# Maint_BankId_Range
source: Bank ID must be a positive number
ar: رقم البنك يجب أن يكون رقماً موجباً
